app/controllers/books_controller.rb

SELECT `books`.* FROM `books` WHERE `books`.`id` = ? LIMIT 1  [["id", "show"]]
---
  def show
    @book = Book.find(params[:id])